/** @file
  String definitions for Secure Boot Configuration form.

Copyright (c) 2011 - 2016, Intel Corporation. All rights reserved.<BR>
This program and the accompanying materials
are licensed and made available under the terms and conditions of the BSD License
which accompanies this distribution.  The full text of the license may be found at
http://opensource.org/licenses/bsd-license.php

THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.

**/

/=#

#langdef   zh-Hans "\wide中文\narrow"
#langdef   en-US   "English"

#string STR_SECUREBOOT_TITLE               #language en-US   "Secure Boot"
                                           #language zh-Hans "\wide安全启动\narrow"
#string STR_SECUREBOOT_TITLE_HELP          #language en-US   "Secure boot settings, include enable/disable function and remove/restore keys."
                                           #language zh-Hans "\wide安全启动设置，包括启用\narrow/\wide禁用功能和删除\narrow/\wide恢复键\narrow。"
#string STR_NULL                           #language en-US   ""
                                           #language zh-Hans ""
#string STR_SECURE_BOOT_STATUS_PROMPT      #language en-US   "Secure Boot Status"
                                           #language zh-Hans "\wide安全启动状态\narrow"
#string STR_SECURE_BOOT_STATUS_SETUP_MODE  #language en-US   "Factory Mode"
                                           #language zh-Hans "\wide工厂模式\narrow"
#string STR_SECURE_BOOT_STATUS_USER_MODE   #language en-US   "User mode"
                                           #language zh-Hans "\wide用户模式\narrow"
#string STR_ENABLE                         #language en-US   "Enabled"
                                           #language zh-Hans "\wide打开\narrow"
#string STR_DISABLE                        #language en-US   "Disabled"
                                           #language zh-Hans "\wide关闭\narrow"
#string STR_SECURE_BOOT_PROMPT             #language en-US   "Secure Boot"
                                           #language zh-Hans "\wide安全启动\narrow"
#string STR_SECURE_BOOT_HELP               #language en-US   "[Enabled] Enables Secure Boot,BIOS will prevent un-authorised OS be loaded.[Disabled] Disables Secure Boot. "
                                           #language zh-Hans "[\wide打开\narrow]\wide：打开安全启动，\narrowBIOS\wide会阻止未被授权的系统被调起。\narrow\n[\wide关闭\narrow]\wide：关闭安全启动。\narrow"

#string STR_RESET_TO_SETUP_MODE            #language en-US   "Reset to Factory Mode"
                                           #language zh-Hans "\wide重置为工厂模式\narrow"
#string STR_RESET_TO_SETUP_MODE_HELP       #language en-US   "Press enter key to reset to setup mode, and will move secure boot to Factory mode."
                                           #language zh-Hans "\wide按回车键将安全启动重置为工厂模式。\narrow"                                           
#string STR_RESTORE_FACTORY_KEY            #language en-US   "Restore Factory Keys"
                                           #language zh-Hans "\wide恢复出厂设置\narrow"                                           
#string STR_RESTORE_FACTORY_KEY_HELP       #language en-US   "Press enter key to restore Factory Keys, and will put secure boot into factory defaults."
                                           #language zh-Hans "\wide按回车键将安全启动恢复出厂设置。\narrow"   

#string STR_YES                            #language en-US   "Yes"
                                           #language zh-Hans "\wide是\narrow"
#string STR_NO                             #language en-US   "No"
                                           #language zh-Hans "\wide否\narrow"
#string STR_RESTORE_FACTORY_KEY_TITLE      #language en-US   "Restore Factory Keys"
                                           #language zh-Hans "\wide恢复出厂设置\narrow"
#string STR_RESTORE_FACTORY_KEY_CONFIRM    #language en-US   "Do you really wish to Install Factory Default Secure Boot Keys?"
                                           #language zh-Hans "\wide确定恢复为出厂设置吗？\narrow"
#string STR_RESET_TO_SETUP_MODE_TITLE      #language en-US   "Reset Platform to Setup Mode"
                                           #language zh-Hans "\wide重置为设定模式\narrow"
#string STR_RESET_TO_SETUP_MODE_CONFIRM    #language en-US   "Do you really wish to reset Platform to Setup Mode?"
                                           #language zh-Hans "\wide确认重置为设定模式吗？\narrow"
#string STR_RESTORE_FACTORY_KEY_WAIT       #language en-US   "Restoring Factory Keys, Wait a moment ..."
                                           #language zh-Hans "\wide正在恢复出厂设置\narrow, \wide请稍等\narrow ..."
                                           
